content/videogames/disco/disco-elysium.org
#+startup: content indent

* Disco Elysium

I wanted to play Disco Elysium since I heard about it, but I always
delayed It. It is quite an involved game, being narrative focused,
and I wanted to play it when I had some mental space.
I figured out that I will never have enough mental space anyway
so I started playing it.

It is a really interesting game, It feels like the choice you make
and the character you are building have a great impact in the story.
Also, you need to pay really attention to the story and the
dialogues. The only other game I payed this much attention and
thought is probably Return of The Obra Dinn (which I played many
many years ago and I would like to play it again, since I don't
remember much).

*** Diary

I am keeping a diary of all that is happening in the game, here It
is:

- [[file:disco-day-1.org][day 1]]

---

Go Back: [[file:../videogames.org][videogames]]
