public/stash/videogames/disco/disco-elysium.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">

<div id="outline-container-org8b79abb" class="outline-2">
<h2 id="org8b79abb">Disco Elysium</h2>
<div class="outline-text-2" id="text-org8b79abb">
<p>
I wanted to play Disco Elysium since I heard about it, but I always
delayed it. It is quite an involved game, being narrative focused,
and I wanted to play it when I had some mental space.
I figured out that I will never have enough mental space anyway
so I started playing it.
</p>

<p>
It is a really interesting game, It feels like the choice you make
and the character you are building have a great impact in the story.
Also, you need to pay really attention to the story and the
dialogues. The only other game I payed this much attention and
thought is probably Return of The Obra Dinn (which I played many
many years ago and I would like to play it again, since I don't
remember much).
</p>
</div>

<div id="outline-container-org4e53dbd" class="outline-4">
<h4 id="org4e53dbd">Diary</h4>
<div class="outline-text-4" id="text-org4e53dbd">
<p>
I am keeping a diary of all that is happening in the game, here it
is:
</p>

<ul class="org-ul">
<li><a href="disco-day-1.html">day 1</a></li>
</ul>

<hr />

<p>
Travel: <a href="../videogames.html">Videogames</a>, <a href="../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
